app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings"
---
  def index
    render json: Listing.all

INSERT INTO "listings" ("name", "description", "price", "image", "vendor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "d"], ["description", "d"], ["price", "0.0"], ["image", "d"], ["vendor_id", 56], ["created_at", "2019-04-18 13:57:43.599790"], ["updated_at", "2019-04-18 13:57:43.599790"]]
---
  def create
    Listing.create(listing_params)